git<?php
/**
 * Created by PhpStorm.
 * User: Stas
 * Date: 19.02.2017
 * Time: 21:08
 */
echo '<h1>--------------------------------------------На count и range---------------------------------------------</h1>';
echo '<h1>-------------------------------------------------1--------------------------------------------------------</h1>';

/*1. Создайте массив, заполненный числами от 1 до 100.*/

foreach (range(0, 100, 10) as $number) {
    print_r($number . ' ');
}

echo '<h1>-------------------------------------------------2--------------------------------------------------------</h1>';

/*2. Дан массив $arr. Подсчитайте количество элементов этого массива.*/

$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7, 8, 0, 9];
$count = count($arr);
echo 'Количество элементов массива ' . $count;

echo '<h1>-------------------------------------------------3--------------------------------------------------------</h1>';

/*3. Дан массив $arr. Выведите на экран первый и последний элемент данного массива.*/

$arr1 = [1, 4, 5, 6, 7, 8, 9, 0, 5, 4, 3, 6, 7, 9, 77, 99];
echo 'первый элемент массива ' . $arr1[0] . ' последний элемент массива ' . $arr1[count($arr1) - 1];

echo '<h1>-------------------------------------------------На array_sum и array_product--------------------------------------------------------</h1>';
echo '<h1>-------------------------------------------------4--------------------------------------------------------</h1>';

/*4. Дан массив $arr. С помощью функций array_sum и count найдите среднее арифметическое элементов данного массива.*/

$arr3 = [3, 4, 5, 6, 54, 3, 4, 56, 7, 8, 95, 3, 2, 1, 9];
$a = array_sum($arr3);
$b = count($arr3);
print_r($arr3);
echo '<br>Среднее арифметическое данного массива ' . $a / $b;

echo '<h1>-------------------------------------------------5--------------------------------------------------------</h1>';

/*5. Создайте массив, заполненный числами от 1 до 300. Найдите произведение элементов данного массива.*/

$arr4 = [];
foreach (range(1, 300, 100) as $value) {
    $arr4[] = $value;
}
echo array_product($arr4);
echo '<h1>-------------------------------------------------На array_merge и array_slice--------------------------------------------------------</h1>';

echo '<h1>-------------------------------------------------6--------------------------------------------------------</h1>';

/*6. Даны два массива: первый с элементами '1', '2', '3', второй с элементами 'a', 'b', 'c'. Сделайте из них массив с элементами '1', '2', '3', 'a', 'b', 'c'.*/

$mas1 = ['1', '2', '3'];
$mas2 = ['a', 'b', 'c'];
$result = array_merge($mas1, $mas2);
print_r($result);
echo '<h1>-------------------------------------------------7--------------------------------------------------------</h1>';

/*7. Даны массив с элементами '1', '2', '3', '4', '5'. С помощью функции array_slice создайте массив $b с элементами '2', '3', '4'.*/

$mas3 = [1, 2, 3, 4, 5];
$b = array_slice($mas3, 1, 3);
print_r($b);

echo '<h1>-------------------------------На array_keys, array_values, array_combine---------------------------------</h1>';
echo '<h1>-------------------------------------------------8--------------------------------------------------------</h1>';

/*8. Дан массив 'green'=>'зеленый', 'blue'=>'голубой', 'red'=>'красный'. Запишите в массив $key английские названия цветов, а в $values – русские.*/

$mas5 = ['green' => 'зеленый', 'blue' => 'голубой', 'red' => 'красный'];
$array_keys = array_keys($mas5);
print_r($array_keys);
echo "<br>";
$array_values = array_values($mas5);
print_r($array_values);

echo '<h1>-------------------------------------------------9--------------------------------------------------------</h1>';

/*9. Даны два массива: 'green', 'blue', 'red' и ''зеленый', 'голубой', 'красный'. Создайте с их помощью массив 'green'=>'зеленый', 'blue'=>'голубой', 'red'=>'красный'. Используйте функцию array_combine.*/

$color1 = ['green', 'blue', 'red'];
$color2 = ['зеленый', 'голубой', 'красный'];
$color3 = array_combine($color1, $color2);
print_r($color3);

echo '<h1>-------------------На array_flip, array_count_values, array_reverse, array_unique-------------------------</h1>';
echo '<h1>-------------------------------------------------10--------------------------------------------------------</h1>';

/*10. Дан массив 'green'=>'зеленый', 'blue'=>'голубой', 'red'=>'красный'. Поменяйте местами ключи и значения.*/

$mas_color = ['green' => 'зеленый', 'blue' => 'голубой', 'red' => 'красный'];
$mas_color = array_flip($mas_color);
print_r($mas_color);

echo '<h1>-------------------------------------------------11--------------------------------------------------------</h1>';

/*11. Дан массив с элементами '1', '2', '3', '4', '5'. Создайте массив с элементами '5', '4', '3', '2', '1'.*/

$array_reverse = ['1', '2', '3', '4', '5'];
$array_reverse = array_reverse($array_reverse);
print_r($array_reverse);

echo '<h1>-------------------------------------------------12--------------------------------------------------------</h1>';

/*12. Дан массив с элементами 'a', 'b', 'c', 'b', 'a'. Удалите из него повторяющиеся элементы.*/

$pov = ['a', 'b', 'c', 'b', 'a'];
$pov = array_unique($pov);
print_r($pov);


echo '<h1>-------------------------------------------------13--------------------------------------------------------</h1>';

/*13. Дан массив с элементами 'a', 'b', 'c', 'b', 'a'. Подсчитайте сколько раз встречается каждая из букв.*/

$count1 = ['a', 'b', 'c', 'b', 'a'];
print_r(array_count_values($count1));


echo '<h1>-------------------На сортировку, shuffle и array_rand-------------------------</h1>';
echo '<h1>-------------------------------------------------14--------------------------------------------------------</h1>';

/*14. Дан массив '3'=>'a', '1'=>'c', '2'=>'e', '4'=>'b'. Попробуйте на нем различные типы сортировок.*/

$qa = ['3' => 'a', '1' => 'c', '2' => 'e', '4' => 'b'];
//shuffle($qa);
arsort($qa);
print_r($qa);

echo '<h1>-------------------------------------------------15--------------------------------------------------------</h1>';

/*15. Дан массив $arr. Перемешайте его элементы в случайном порядке.*/

$qa = ['3' => 'a', '1' => 'c', '2' => 'e', '4' => 'b'];
shuffle($qa);
print_r($qa);

echo '<h1>-------------------------------------------------16--------------------------------------------------------</h1>';
/*16. Дан массив с элементами '1', '2', '3', '4', '5'. Выведите на экран случайный элемент данного масссива.*/

$arrr = ['1', '2', '3', '4', '5'];
$rand = array_rand($arrr, 1);
print_r($rand);

echo '<h1>-------------------На array_map и array_walk-------------------------</h1>';
echo '<h1>-------------------------------------------------17--------------------------------------------------------</h1>';
/*17. Дан массив с элементами '1', '2', '3', '4', '5'. Создайте новый массив, в котором будут лежать квадратные корни данных элементов.*/

function kor($n){
    return sqrt($n);
}
$arrrr = ['1', '2', '3', '4', '5'];
$b = array_map("kor", $arrrr);
print_r($b);

echo '<h1>-------------------------------------------------18--------------------------------------------------------</h1>';

/*18. Дан массив с элементами '<b>php</b>', '<i>html</i>'. Создайте новый массив, в котором из элементов будут удалены теги.*/

$teg = ['<b>php</b>', '<i>html</i>'];
function teg($n){
    return strip_tags($n);
}
array_walk($teg, "teg");
print_r($teg);
echo '<h1>-------------------------------------------------19--------------------------------------------------------</h1>';

/*19. Дан массив с элементами ' a ', ' b ', ' с '. Создайте новый массив, в котором будут данные элементы без концевых пробелов.*/

$trim = [' a ', ' b ', ' с'];
function trim_value(&$n)
{
    $n = trim($n);
}
array_walk($trim , 'trim_value');
var_dump($trim);

echo '<h1>-------------------На array_chunk и array_pad-------------------------</h1>';
echo '<h1>-------------------------------------------------20--------------------------------------------------------</h1>';

/*20. Дан массив с элементами '1', '2', '3'. Сделайте из него массив с элементами '1', '2', '3', '0', '0', '0'.*/
$ms = ['1', '2', '3'];
$result3 = array_pad($ms, 6, 0);
print_r($result3);
echo '<h1>-------------------------------------------------21--------------------------------------------------------</h1>';
/*21. Создайте массив, заполненный целыми числами от 1 до 20. С помощью функции array_chunk разбейте этот массив на 5 подмассивов ('1', '2', '3', '4'; '5', '6', '7', '8' и т.д.).*/
$array = range(1,20,1);
$result2 = array_chunk($array, 4);
print '<pre>';
print_r($result2);
print '</pre>';